garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1615.PIC
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PID1Z1H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PID1Z1H" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02712_math_progmac_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x59C">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PID1Z18" edc:desc="" edc:mask="0x1" edc:name="PID1Z18" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1Z19" edc:desc="" edc:mask="0x1" edc:name="PID1Z19" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1Z110" edc:desc="" edc:mask="0x1" edc:name="PID1Z110" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1Z111" edc:desc="" edc:mask="0x1" edc:name="PID1Z111" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1Z112" edc:desc="" edc:mask="0x1" edc:name="PID1Z112" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1Z113" edc:desc="" edc:mask="0x1" edc:name="PID1Z113" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1Z114" edc:desc="" edc:mask="0x1" edc:name="PID1Z114" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1Z115" edc:desc="" edc:mask="0x1" edc:name="PID1Z115" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="Z18" edc:desc="" edc:mask="0x1" edc:name="Z18" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="Z19" edc:desc="" edc:mask="0x1" edc:name="Z19" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="Z110" edc:desc="" edc:mask="0x1" edc:name="Z110" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="Z111" edc:desc="" edc:mask="0x1" edc:name="Z111" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="Z112" edc:desc="" edc:mask="0x1" edc:name="Z112" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="Z113" edc:desc="" edc:mask="0x1" edc:name="Z113" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="Z114" edc:desc="" edc:mask="0x1" edc:name="Z114" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="Z115" edc:desc="" edc:mask="0x1" edc:name="Z115" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="-------n" edc:cname="PID1Z1U" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------0" edc:name="PID1Z1U" edc:nzwidth="8" edc:por="-------0" edc:_modsrc="DOS-02712_math_progmac_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x59D">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PID1Z116" edc:desc="" edc:mask="0x1" edc:name="PID1Z116" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="Z116" edc:desc="" edc:mask="0x1" edc:name="Z116" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:AdjustPoint edc:offset="2" edc:_addr="0x59E"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="12" edc:beginaddr="0x600" edc:endaddr="0x620" edc:regionid="sfr12">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x600"/>
        <edc:JoinedSFRDef edc:cname="PID1Z2" edc:desc="" edc:name="PID1Z2" edc:nzwidth="0x18" edc:_modsrc="DOS-02712_math_progmac_v1.Module" edc:_refcount="2" edc:_begin="0x10" edc:_end="0x1b" edc:_addr="0x60C">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PID1Z2L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PID1Z2L" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02712_math_progmac_v1.Module" edc:_refcount="2" edc:_begin="0x10" edc:_end="0x1b" edc:_addr="0x60C">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PID1Z20" edc:desc="" edc:mask="0x1" edc:name="PID1Z20" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1Z21" edc:desc="" edc:mask="0x1" edc:name="PID1Z21" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1Z22" edc:desc="" edc:mask="0x1" edc:name="PID1Z22" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1Z23" edc:desc="" edc:mask="0x1" edc:name="PID1Z23" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1Z24" edc:desc="" edc:mask="0x1" edc:name="PID1Z24" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1Z25" edc:desc="" edc:mask="0x1" edc:name="PID1Z25" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1Z26" edc:desc="" edc:mask="0x1" edc:name="PID1Z26" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1Z27" edc:desc="" edc:mask="0x1" edc:name="PID1Z27" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="Z20" edc:desc="" edc:mask="0x1" edc:name="Z20" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="Z21" edc:desc="" edc:mask="0x1" edc:name="Z21" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="Z22" edc:desc="" edc:mask="0x1" edc:name="Z22" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="Z23" edc:desc="" edc:mask="0x1" edc:name="Z23" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="Z24" edc:desc="" edc:mask="0x1" edc:name="Z24" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="Z25" edc:desc="" edc:mask="0x1" edc:name="Z25" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="Z26" edc:desc="" edc:mask="0x1" edc:name="Z26" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="Z27" edc:desc="" edc:mask="0x1" edc:name="Z27" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PID1Z2H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PID1Z2H" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02712_math_progmac_v1.Module" edc:_refcount="2" edc:_begin="0x10" edc:_end="0x1b" edc:_addr="0x60D">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PID1Z28" edc:desc="" edc:mask="0x1" edc:name="PID1Z28" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1Z29" edc:desc="" edc:mask="0x1" edc:name="PID1Z29" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1Z210" edc:desc="" edc:mask="0x1" edc:name="PID1Z210" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1Z211" edc:desc="" edc:mask="0x1" edc:name="PID1Z211" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1Z212" edc:desc="" edc:mask="0x1" edc:name="PID1Z212" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1Z213" edc:desc="" edc:mask="0x1" edc:name="PID1Z213" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1Z214" edc:desc="" edc:mask="0x1" edc:name="PID1Z214" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1Z215" edc:desc="" edc:mask="0x1" edc:name="PID1Z215" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="Z28" edc:desc="" edc:mask="0x1" edc:name="Z28" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="Z29" edc:desc="" edc:mask="0x1" edc:name="Z29" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="Z210" edc:desc="" edc:mask="0x1" edc:name="Z210" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="Z211" edc:desc="" edc:mask="0x1" edc:name="Z211" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="Z212" edc:desc="" edc:mask="0x1" edc:name="Z212" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="Z213" edc:desc="" edc:mask="0x1" edc:name="Z213" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="Z214" edc:desc="" edc:mask="0x1" edc:name="Z214" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="Z215" edc:desc="" edc:mask="0x1" edc:name="Z215" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
