garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1615.PIC
        <edc:SFRDef edc:access="nnnnnnnr" edc:cname="CRCCON1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CRCCON1" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02421_math_progcrc_v4.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x79A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PLEN" edc:desc="" edc:mask="0xf" edc:name="PLEN" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="DLEN" edc:desc="" edc:mask="0xf" edc:name="DLEN" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PLEN0" edc:desc="" edc:mask="0x1" edc:name="PLEN0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PLEN1" edc:desc="" edc:mask="0x1" edc:name="PLEN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PLEN2" edc:desc="" edc:mask="0x1" edc:name="PLEN2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PLEN3" edc:desc="" edc:mask="0x1" edc:name="PLEN3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DLEN0" edc:desc="" edc:mask="0x1" edc:name="DLEN0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DLEN1" edc:desc="" edc:mask="0x1" edc:name="DLEN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DLEN2" edc:desc="" edc:mask="0x1" edc:name="DLEN2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DLEN3" edc:desc="" edc:mask="0x1" edc:name="DLEN3" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CRCPLEN" edc:desc="" edc:mask="0xf" edc:name="CRCPLEN" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="CRCDLEN" edc:desc="" edc:mask="0xf" edc:name="CRCDLEN" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="CRCPLEN0" edc:desc="" edc:mask="0x1" edc:name="CRCPLEN0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CRCPLEN1" edc:desc="" edc:mask="0x1" edc:name="CRCPLEN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CRCPLEN2" edc:desc="" edc:mask="0x1" edc:name="CRCPLEN2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CRCPLEN3" edc:desc="" edc:mask="0x1" edc:name="CRCPLEN3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CRCDLEN0" edc:desc="" edc:mask="0x1" edc:name="CRCDLEN0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CRCDLEN1" edc:desc="" edc:mask="0x1" edc:name="CRCDLEN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CRCDLEN2" edc:desc="" edc:mask="0x1" edc:name="CRCDLEN2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CRCDLEN3" edc:desc="" edc:mask="0x1" edc:name="CRCDLEN3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="5" edc:_addr="0x79B"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="16" edc:beginaddr="0x800" edc:endaddr="0x820" edc:regionid="sfr16">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x800"/>
        <edc:JoinedSFRDef edc:cname="AT1RES" edc:desc="" edc:name="AT1RES" edc:nzwidth="0x10" edc:_modsrc="DOS-02644_tmr_angular_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x80C">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="AT1RESL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="AT1RESL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02644_tmr_angular_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x80C">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="AT1RES0" edc:desc="" edc:mask="0x1" edc:name="AT1RES0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1RES1" edc:desc="" edc:mask="0x1" edc:name="AT1RES1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1RES2" edc:desc="" edc:mask="0x1" edc:name="AT1RES2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1RES3" edc:desc="" edc:mask="0x1" edc:name="AT1RES3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1RES4" edc:desc="" edc:mask="0x1" edc:name="AT1RES4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1RES5" edc:desc="" edc:mask="0x1" edc:name="AT1RES5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1RES6" edc:desc="" edc:mask="0x1" edc:name="AT1RES6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1RES7" edc:desc="" edc:mask="0x1" edc:name="AT1RES7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="RES0" edc:desc="" edc:mask="0x1" edc:name="RES0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="RES1" edc:desc="" edc:mask="0x1" edc:name="RES1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="RES2" edc:desc="" edc:mask="0x1" edc:name="RES2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="RES3" edc:desc="" edc:mask="0x1" edc:name="RES3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="RES4" edc:desc="" edc:mask="0x1" edc:name="RES4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="RES5" edc:desc="" edc:mask="0x1" edc:name="RES5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="RES6" edc:desc="" edc:mask="0x1" edc:name="RES6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="RES7" edc:desc="" edc:mask="0x1" edc:name="RES7" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="------nn" edc:cname="AT1RESH" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------uu" edc:name="AT1RESH" edc:nzwidth="8" edc:por="------xx" edc:_modsrc="DOS-02644_tmr_angular_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x80D">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="AT1RES8" edc:desc="" edc:mask="0x1" edc:name="AT1RES8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1RES9" edc:desc="" edc:mask="0x1" edc:name="AT1RES9" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="RES8" edc:desc="" edc:mask="0x1" edc:name="RES8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="RES9" edc:desc="" edc:mask="0x1" edc:name="RES9" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="AT1MISS" edc:desc="" edc:name="AT1MISS" edc:nzwidth="0x10" edc:_modsrc="DOS-02644_tmr_angular_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x80E">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="AT1MISSL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="AT1MISSL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02644_tmr_angular_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x80E">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="AT1MISS0" edc:desc="" edc:mask="0x1" edc:name="AT1MISS0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1MISS1" edc:desc="" edc:mask="0x1" edc:name="AT1MISS1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1MISS2" edc:desc="" edc:mask="0x1" edc:name="AT1MISS2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1MISS3" edc:desc="" edc:mask="0x1" edc:name="AT1MISS3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1MISS4" edc:desc="" edc:mask="0x1" edc:name="AT1MISS4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1MISS5" edc:desc="" edc:mask="0x1" edc:name="AT1MISS5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1MISS6" edc:desc="" edc:mask="0x1" edc:name="AT1MISS6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1MISS7" edc:desc="" edc:mask="0x1" edc:name="AT1MISS7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="MISS0" edc:desc="" edc:mask="0x1" edc:name="MISS0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="MISS1" edc:desc="" edc:mask="0x1" edc:name="MISS1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="MISS2" edc:desc="" edc:mask="0x1" edc:name="MISS2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="MISS3" edc:desc="" edc:mask="0x1" edc:name="MISS3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="MISS4" edc:desc="" edc:mask="0x1" edc:name="MISS4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="MISS5" edc:desc="" edc:mask="0x1" edc:name="MISS5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="MISS6" edc:desc="" edc:mask="0x1" edc:name="MISS6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="MISS7" edc:desc="" edc:mask="0x1" edc:name="MISS7" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="AT1MISSH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="AT1MISSH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02644_tmr_angular_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x80F">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="AT1MISS8" edc:desc="" edc:mask="0x1" edc:name="AT1MISS8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1MISS9" edc:desc="" edc:mask="0x1" edc:name="AT1MISS9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1MISS10" edc:desc="" edc:mask="0x1" edc:name="AT1MISS10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1MISS11" edc:desc="" edc:mask="0x1" edc:name="AT1MISS11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1MISS12" edc:desc="" edc:mask="0x1" edc:name="AT1MISS12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1MISS13" edc:desc="" edc:mask="0x1" edc:name="AT1MISS13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1MISS14" edc:desc="" edc:mask="0x1" edc:name="AT1MISS14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1MISS15" edc:desc="" edc:mask="0x1" edc:name="AT1MISS15" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="MISS8" edc:desc="" edc:mask="0x1" edc:name="MISS8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="MISS9" edc:desc="" edc:mask="0x1" edc:name="MISS9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="MISS10" edc:desc="" edc:mask="0x1" edc:name="MISS10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="MISS11" edc:desc="" edc:mask="0x1" edc:name="MISS11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="MISS12" edc:desc="" edc:mask="0x1" edc:name="MISS12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="MISS13" edc:desc="" edc:mask="0x1" edc:name="MISS13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="MISS14" edc:desc="" edc:mask="0x1" edc:name="MISS14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="MISS15" edc:desc="" edc:mask="0x1" edc:name="MISS15" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="AT1PER" edc:desc="" edc:name="AT1PER" edc:nzwidth="0x10" edc:_modsrc="DOS-02644_tmr_angular_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x810">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="AT1PERL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="AT1PERL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02644_tmr_angular_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x810">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="AT1PER0" edc:desc="" edc:mask="0x1" edc:name="AT1PER0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1PER1" edc:desc="" edc:mask="0x1" edc:name="AT1PER1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1PER2" edc:desc="" edc:mask="0x1" edc:name="AT1PER2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1PER3" edc:desc="" edc:mask="0x1" edc:name="AT1PER3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1PER4" edc:desc="" edc:mask="0x1" edc:name="AT1PER4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1PER5" edc:desc="" edc:mask="0x1" edc:name="AT1PER5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1PER6" edc:desc="" edc:mask="0x1" edc:name="AT1PER6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1PER7" edc:desc="" edc:mask="0x1" edc:name="AT1PER7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PER0" edc:desc="" edc:mask="0x1" edc:name="PER0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PER1" edc:desc="" edc:mask="0x1" edc:name="PER1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PER2" edc:desc="" edc:mask="0x1" edc:name="PER2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PER3" edc:desc="" edc:mask="0x1" edc:name="PER3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PER4" edc:desc="" edc:mask="0x1" edc:name="PER4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PER5" edc:desc="" edc:mask="0x1" edc:name="PER5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PER6" edc:desc="" edc:mask="0x1" edc:name="PER6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PER7" edc:desc="" edc:mask="0x1" edc:name="PER7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PERL0" edc:mask="0x1" edc:name="PERL0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PERL1" edc:mask="0x1" edc:name="PERL1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PERL2" edc:mask="0x1" edc:name="PERL2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PERL3" edc:mask="0x1" edc:name="PERL3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PERL4" edc:mask="0x1" edc:name="PERL4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PERL5" edc:mask="0x1" edc:name="PERL5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PERL6" edc:mask="0x1" edc:name="PERL6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PERL7" edc:mask="0x1" edc:name="PERL7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="AT1PERH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="AT1PERH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02644_tmr_angular_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x811">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="AT1PER8" edc:desc="" edc:mask="0x1" edc:name="AT1PER8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1PER9" edc:desc="" edc:mask="0x1" edc:name="AT1PER9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1PER10" edc:desc="" edc:mask="0x1" edc:name="AT1PER10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1PER11" edc:desc="" edc:mask="0x1" edc:name="AT1PER11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1PER12" edc:desc="" edc:mask="0x1" edc:name="AT1PER12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1PER13" edc:desc="" edc:mask="0x1" edc:name="AT1PER13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1PER14" edc:desc="" edc:mask="0x1" edc:name="AT1PER14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1POV" edc:desc="" edc:mask="0x1" edc:name="AT1POV" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PER8" edc:desc="" edc:mask="0x1" edc:name="PER8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PER9" edc:desc="" edc:mask="0x1" edc:name="PER9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PER10" edc:desc="" edc:mask="0x1" edc:name="PER10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PER11" edc:desc="" edc:mask="0x1" edc:name="PER11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PER12" edc:desc="" edc:mask="0x1" edc:name="PER12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PER13" edc:desc="" edc:mask="0x1" edc:name="PER13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PER14" edc:desc="" edc:mask="0x1" edc:name="PER14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PER15" edc:desc="" edc:mask="0x1" edc:name="PER15" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PERH0" edc:mask="0x1" edc:name="PERH0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PERH1" edc:mask="0x1" edc:name="PERH1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PERH2" edc:mask="0x1" edc:name="PERH2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PERH3" edc:mask="0x1" edc:name="PERH3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PERH4" edc:mask="0x1" edc:name="PERH4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PERH5" edc:mask="0x1" edc:name="PERH5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PERH6" edc:mask="0x1" edc:name="PERH6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PERH7" edc:mask="0x1" edc:name="PERH7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="AT1PHS" edc:desc="" edc:name="AT1PHS" edc:nzwidth="0x10" edc:_modsrc="DOS-02644_tmr_angular_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x812">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="AT1PHSL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="AT1PHSL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02644_tmr_angular_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x812">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="AT1PHS0" edc:desc="" edc:mask="0x1" edc:name="AT1PHS0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1PHS1" edc:desc="" edc:mask="0x1" edc:name="AT1PHS1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1PHS2" edc:desc="" edc:mask="0x1" edc:name="AT1PHS2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1PHS3" edc:desc="" edc:mask="0x1" edc:name="AT1PHS3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1PHS4" edc:desc="" edc:mask="0x1" edc:name="AT1PHS4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1PHS5" edc:desc="" edc:mask="0x1" edc:name="AT1PHS5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1PHS6" edc:desc="" edc:mask="0x1" edc:name="AT1PHS6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1PHS7" edc:desc="" edc:mask="0x1" edc:name="AT1PHS7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PHS0" edc:desc="" edc:mask="0x1" edc:name="PHS0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PHS1" edc:desc="" edc:mask="0x1" edc:name="PHS1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PHS2" edc:desc="" edc:mask="0x1" edc:name="PHS2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PHS3" edc:desc="" edc:mask="0x1" edc:name="PHS3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PHS4" edc:desc="" edc:mask="0x1" edc:name="PHS4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PHS5" edc:desc="" edc:mask="0x1" edc:name="PHS5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PHS6" edc:desc="" edc:mask="0x1" edc:name="PHS6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PHS7" edc:desc="" edc:mask="0x1" edc:name="PHS7" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="------rr" edc:cname="AT1PHSH" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------xx" edc:name="AT1PHSH" edc:nzwidth="8" edc:por="------xx" edc:_modsrc="DOS-02644_tmr_angular_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x813">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="AT1PHS8" edc:desc="" edc:mask="0x1" edc:name="AT1PHS8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1PHS9" edc:desc="" edc:mask="0x1" edc:name="AT1PHS9" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PHS8" edc:desc="" edc:mask="0x1" edc:name="PHS8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PHS9" edc:desc="" edc:mask="0x1" edc:name="PHS9" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PHSL8" edc:mask="0x1" edc:name="PHSL8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PHSL9" edc:mask="0x1" edc:name="PHSL9" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
