garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1615.PIC
        <edc:SFRDef edc:access="n-nnnnnn" edc:cname="SMT1CON0" edc:desc="" edc:impl="0xbf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-000000" edc:name="SMT1CON0" edc:nzwidth="8" edc:por="0-000000" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0xD98">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SMT1PS" edc:desc="" edc:mask="0x3" edc:name="SMT1PS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="CPOL" edc:desc="" edc:mask="0x1" edc:name="CPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SPOL" edc:desc="" edc:mask="0x1" edc:name="SPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WPOL" edc:desc="" edc:mask="0x1" edc:name="WPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STP" edc:desc="" edc:mask="0x1" edc:name="STP" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="SMT1PS0" edc:desc="" edc:mask="0x1" edc:name="SMT1PS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT1PS1" edc:desc="" edc:mask="0x1" edc:name="SMT1PS1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn--nnnn" edc:cname="SMT1CON1" edc:desc="" edc:impl="0xcf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00--0000" edc:name="SMT1CON1" edc:nzwidth="8" edc:por="00--0000" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0xD99">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0xf" edc:name="MODE" edc:nzwidth="4"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="REPEAT" edc:desc="" edc:mask="0x1" edc:name="REPEAT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT1GO" edc:desc="" edc:mask="0x1" edc:name="SMT1GO" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE2" edc:desc="" edc:mask="0x1" edc:name="MODE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE3" edc:desc="" edc:mask="0x1" edc:name="MODE3" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SMT1MODE" edc:desc="" edc:mask="0xf" edc:name="SMT1MODE" edc:nzwidth="4"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="SMT1REPEAT" edc:desc="" edc:mask="0x1" edc:name="SMT1REPEAT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="SMT1MODE0" edc:desc="" edc:mask="0x1" edc:name="SMT1MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT1MODE1" edc:desc="" edc:mask="0x1" edc:name="SMT1MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT1MODE2" edc:desc="" edc:mask="0x1" edc:name="SMT1MODE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT1MODE3" edc:desc="" edc:mask="0x1" edc:name="SMT1MODE3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn--rrr" edc:cname="SMT1STAT" edc:desc="" edc:impl="0xe7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000--000" edc:name="SMT1STAT" edc:nzwidth="8" edc:por="000--000" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0xD9A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="AS" edc:desc="" edc:mask="0x1" edc:name="AS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WS" edc:desc="" edc:mask="0x1" edc:name="WS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TS" edc:desc="" edc:mask="0x1" edc:name="TS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RST" edc:desc="" edc:mask="0x1" edc:name="RST" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CPWUP" edc:desc="" edc:mask="0x1" edc:name="CPWUP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CPRUP" edc:desc="" edc:mask="0x1" edc:name="CPRUP" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SMT1AS" edc:desc="" edc:mask="0x1" edc:name="SMT1AS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT1WS" edc:desc="" edc:mask="0x1" edc:name="SMT1WS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT1TS" edc:desc="" edc:mask="0x1" edc:name="SMT1TS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="SMT1RESET" edc:desc="" edc:mask="0x1" edc:name="SMT1RESET" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT1CPWUP" edc:desc="" edc:mask="0x1" edc:name="SMT1CPWUP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT1CPRUP" edc:desc="" edc:mask="0x1" edc:name="SMT1CPRUP" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="SMT1CLK" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="SMT1CLK" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0xD9B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CSEL" edc:desc="" edc:mask="0x7" edc:name="CSEL" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CSEL0" edc:desc="" edc:mask="0x1" edc:name="CSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSEL1" edc:desc="" edc:mask="0x1" edc:name="CSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSEL2" edc:desc="" edc:mask="0x1" edc:name="CSEL2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SMT1CSEL" edc:desc="" edc:mask="0x7" edc:name="SMT1CSEL" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="SMT1CSEL0" edc:desc="" edc:mask="0x1" edc:name="SMT1CSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT1CSEL1" edc:desc="" edc:mask="0x1" edc:name="SMT1CSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT1CSEL2" edc:desc="" edc:mask="0x1" edc:name="SMT1CSEL2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
