garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1615.PIC
        <edc:SFRDef edc:access="---nnnnn" edc:cname="T5GPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="T5GPPS" edc:nzwidth="8" edc:por="---10011" edc:_addr="0xE1D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T5GPPS" edc:mask="0x1f" edc:name="T5GPPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T5GPPS0" edc:desc="" edc:mask="0x1" edc:name="T5GPPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T5GPPS1" edc:desc="" edc:mask="0x1" edc:name="T5GPPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T5GPPS2" edc:desc="" edc:mask="0x1" edc:name="T5GPPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T5GPPS3" edc:desc="" edc:mask="0x1" edc:name="T5GPPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T5GPPS4" edc:desc="" edc:mask="0x1" edc:name="T5GPPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="T6CKIPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="T6CKIPPS" edc:nzwidth="8" edc:por="---00011" edc:_addr="0xE1E">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="T6PPS"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T6CKIPPS" edc:mask="0x1f" edc:name="T6CKIPPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="T6CKIPPS0" edc:mask="0x1" edc:name="T6CKIPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T6CKIPPS1" edc:mask="0x1" edc:name="T6CKIPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T6CKIPPS2" edc:mask="0x1" edc:name="T6CKIPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T6CKIPPS3" edc:mask="0x1" edc:name="T6CKIPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T6CKIPPS4" edc:mask="0x1" edc:name="T6CKIPPS4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T6PPS" edc:mask="0x1f" edc:name="T6PPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T6PPS0" edc:desc="" edc:mask="0x1" edc:name="T6PPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T6PPS1" edc:desc="" edc:mask="0x1" edc:name="T6PPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T6PPS2" edc:desc="" edc:mask="0x1" edc:name="T6PPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T6PPS3" edc:desc="" edc:mask="0x1" edc:name="T6PPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T6PPS4" edc:desc="" edc:mask="0x1" edc:name="T6PPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="ATCC1PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="ATCC1PPS" edc:nzwidth="8" edc:por="---10011" edc:_addr="0xE1F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ATCC1PPS" edc:mask="0x1f" edc:name="ATCC1PPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ATCC1PPS0" edc:desc="" edc:mask="0x1" edc:name="ATCC1PPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ATCC1PPS1" edc:desc="" edc:mask="0x1" edc:name="ATCC1PPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ATCC1PPS2" edc:desc="" edc:mask="0x1" edc:name="ATCC1PPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ATCC1PPS3" edc:desc="" edc:mask="0x1" edc:name="ATCC1PPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ATCC1PPS4" edc:desc="" edc:mask="0x1" edc:name="ATCC1PPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="SSPCLKPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="SSPCLKPPS" edc:nzwidth="8" edc:por="---10000" edc:_addr="0xE20">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SSPCLKPPS" edc:mask="0x1f" edc:name="SSPCLKPPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SSPCLKPPS0" edc:desc="" edc:mask="0x1" edc:name="SSPCLKPPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSPCLKPPS1" edc:desc="" edc:mask="0x1" edc:name="SSPCLKPPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSPCLKPPS2" edc:desc="" edc:mask="0x1" edc:name="SSPCLKPPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSPCLKPPS3" edc:desc="" edc:mask="0x1" edc:name="SSPCLKPPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSPCLKPPS4" edc:desc="" edc:mask="0x1" edc:name="SSPCLKPPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="SSPDATPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="SSPDATPPS" edc:nzwidth="8" edc:por="---10001" edc:_addr="0xE21">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SSPDATPPS" edc:mask="0x1f" edc:name="SSPDATPPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SSPDATPPS0" edc:desc="" edc:mask="0x1" edc:name="SSPDATPPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSPDATPPS1" edc:desc="" edc:mask="0x1" edc:name="SSPDATPPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSPDATPPS2" edc:desc="" edc:mask="0x1" edc:name="SSPDATPPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSPDATPPS3" edc:desc="" edc:mask="0x1" edc:name="SSPDATPPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSPDATPPS4" edc:desc="" edc:mask="0x1" edc:name="SSPDATPPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="SSPSSPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="SSPSSPPS" edc:nzwidth="8" edc:por="---10011" edc:_addr="0xE22">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SSPSSPPS" edc:mask="0x1f" edc:name="SSPSSPPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SSPSSPPS0" edc:desc="" edc:mask="0x1" edc:name="SSPSSPPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSPSSPPS1" edc:desc="" edc:mask="0x1" edc:name="SSPSSPPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSPSSPPS2" edc:desc="" edc:mask="0x1" edc:name="SSPSSPPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSPSSPPS3" edc:desc="" edc:mask="0x1" edc:name="SSPSSPPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSPSSPPS4" edc:desc="" edc:mask="0x1" edc:name="SSPSSPPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="ATCC2PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="ATCC2PPS" edc:nzwidth="8" edc:por="---10100" edc:_addr="0xE23">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ATCC2PPS" edc:mask="0x1f" edc:name="ATCC2PPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ATCC2PPS0" edc:desc="" edc:mask="0x1" edc:name="ATCC2PPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ATCC2PPS1" edc:desc="" edc:mask="0x1" edc:name="ATCC2PPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ATCC2PPS2" edc:desc="" edc:mask="0x1" edc:name="ATCC2PPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ATCC2PPS3" edc:desc="" edc:mask="0x1" edc:name="ATCC2PPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ATCC2PPS4" edc:desc="" edc:mask="0x1" edc:name="ATCC2PPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RXPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RXPPS" edc:nzwidth="8" edc:por="---10101" edc:_addr="0xE24">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXPPS" edc:mask="0x1f" edc:name="RXPPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RXPPS0" edc:desc="" edc:mask="0x1" edc:name="RXPPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXPPS1" edc:desc="" edc:mask="0x1" edc:name="RXPPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXPPS2" edc:desc="" edc:mask="0x1" edc:name="RXPPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXPPS3" edc:desc="" edc:mask="0x1" edc:name="RXPPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXPPS4" edc:desc="" edc:mask="0x1" edc:name="RXPPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="CKPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="CKPPS" edc:nzwidth="8" edc:por="---10100" edc:_addr="0xE25">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CKPPS" edc:mask="0x1f" edc:name="CKPPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CKPPS0" edc:desc="" edc:mask="0x1" edc:name="CKPPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CKPPS1" edc:desc="" edc:mask="0x1" edc:name="CKPPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CKPPS2" edc:desc="" edc:mask="0x1" edc:name="CKPPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CKPPS3" edc:desc="" edc:mask="0x1" edc:name="CKPPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CKPPS4" edc:desc="" edc:mask="0x1" edc:name="CKPPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="SMT1SIGPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="SMT1SIGPPS" edc:nzwidth="8" edc:por="---00100" edc:_addr="0xE26">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SMT1SIGPPS" edc:mask="0x1f" edc:name="SMT1SIGPPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SMT1SIGPPS0" edc:desc="" edc:mask="0x1" edc:name="SMT1SIGPPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT1SIGPPS1" edc:desc="" edc:mask="0x1" edc:name="SMT1SIGPPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT1SIGPPS2" edc:desc="" edc:mask="0x1" edc:name="SMT1SIGPPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT1SIGPPS3" edc:desc="" edc:mask="0x1" edc:name="SMT1SIGPPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT1SIGPPS4" edc:desc="" edc:mask="0x1" edc:name="SMT1SIGPPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="SMT1WINPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="SMT1WINPPS" edc:nzwidth="8" edc:por="---00101" edc:_addr="0xE27">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SMT1WINPPS" edc:mask="0x1f" edc:name="SMT1WINPPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SMTWINPPS0" edc:desc="" edc:mask="0x1" edc:name="SMTWINPPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMTWINPPS1" edc:desc="" edc:mask="0x1" edc:name="SMTWINPPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMTWINPPS2" edc:desc="" edc:mask="0x1" edc:name="SMTWINPPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMTWINPPS3" edc:desc="" edc:mask="0x1" edc:name="SMTWINPPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMTWINPPS4" edc:desc="" edc:mask="0x1" edc:name="SMTWINPPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="CLCIN0PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="CLCIN0PPS" edc:nzwidth="8" edc:por="---10011" edc:_addr="0xE28">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLCN0PPS" edc:mask="0x1f" edc:name="CLCN0PPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CLCIN0PPS0" edc:desc="" edc:mask="0x1" edc:name="CLCIN0PPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLCIN0PPS1" edc:desc="" edc:mask="0x1" edc:name="CLCIN0PPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLCIN0PPS2" edc:desc="" edc:mask="0x1" edc:name="CLCIN0PPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLCIN0PPS3" edc:desc="" edc:mask="0x1" edc:name="CLCIN0PPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLCIN0PPS4" edc:desc="" edc:mask="0x1" edc:name="CLCIN0PPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="CLCIN1PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="CLCIN1PPS" edc:nzwidth="8" edc:por="---10100" edc:_addr="0xE29">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLCIN1PPS" edc:mask="0x1f" edc:name="CLCIN1PPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CLCIN1PPS0" edc:desc="" edc:mask="0x1" edc:name="CLCIN1PPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLCIN1PPS1" edc:desc="" edc:mask="0x1" edc:name="CLCIN1PPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLCIN1PPS2" edc:desc="" edc:mask="0x1" edc:name="CLCIN1PPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLCIN1PPS3" edc:desc="" edc:mask="0x1" edc:name="CLCIN1PPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLCIN1PPS4" edc:desc="" edc:mask="0x1" edc:name="CLCIN1PPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="CLCIN2PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="CLCIN2PPS" edc:nzwidth="8" edc:por="---10001" edc:_addr="0xE2A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLCIN2PPS" edc:mask="0x1f" edc:name="CLCIN2PPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CLCIN2PPS0" edc:desc="" edc:mask="0x1" edc:name="CLCIN2PPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLCIN2PPS1" edc:desc="" edc:mask="0x1" edc:name="CLCIN2PPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLCIN2PPS2" edc:desc="" edc:mask="0x1" edc:name="CLCIN2PPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLCIN2PPS3" edc:desc="" edc:mask="0x1" edc:name="CLCIN2PPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLCIN2PPS4" edc:desc="" edc:mask="0x1" edc:name="CLCIN2PPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="CLCIN3PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="CLCIN3PPS" edc:nzwidth="8" edc:por="---00101" edc:_addr="0xE2B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLCIN3PPS" edc:mask="0x1f" edc:name="CLCIN3PPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CLCIN3PPS0" edc:desc="" edc:mask="0x1" edc:name="CLCIN3PPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLCIN3PPS1" edc:desc="" edc:mask="0x1" edc:name="CLCIN3PPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLCIN3PPS2" edc:desc="" edc:mask="0x1" edc:name="CLCIN3PPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLCIN3PPS3" edc:desc="" edc:mask="0x1" edc:name="CLCIN3PPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLCIN3PPS4" edc:desc="" edc:mask="0x1" edc:name="CLCIN3PPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
